"""

Создайте собственный класс-исключение, обрабатывающий ситуацию деления на ноль.
Проверьте его работу на данных, вводимых пользователем.
При вводе нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.

"""


class Custom_Exception:  # задаем наше исключение
    def __init__(self, a, b):  # задаем наш интерпретатор
        self.a = a
        self.b = b

    @staticmethod  # задаем наше исключение в декораторе
    def divider(a, b):
        try:
            return a / b
        except:
            return f'Делить на ноль НЕЛЬЗЯ!'


print(Custom_Exception.divider(50, 10))
print(Custom_Exception.divider(50, 0))
