"""
Дан список:
['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками (добавить кавычку до
и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух целочисленных разрядов:
['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
Сформировать из обработанного списка строку:
в "05" часов "17" минут температура воздуха была "+05" градусов
Подумать, какое условие записать, чтобы выявить числа среди элементов списка? Как модифицировать это условие для
чисел со знаком?
print(result)
Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже. Главное:
дополнить числа до двух разрядов нулём!
"""

# задаем переменную списка

condition = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

# реверсируем список, чтобы поставить ковычки с одной стороны значения

condition.reverse()
for value in condition:
    if ord(value[-1]) in range(48, 58):
        condition.insert((condition.index(value) + 1), '"')
condition.reverse()

# тоже самое с другой стороны

for value in condition:
    if ord(value[-1]) in range(48, 58):
        condition.insert((condition.index(value) + 1), '"')

# форматируем числовые значения

for value in condition:
    if ord(value[0]) == 43 or ord(value[0]) == 45:
        new = int(value[1:])
        new_value = '{:02d}'.format(new)
        index = condition.index(value)
        condition[index] = value[:1] + new_value

for value in condition:
    if ord(value[0]) in range(48, 58):
        new = int(value)
        new_value = '{:02d}'.format(new)
        index = condition.index(value)
        condition[index] = new_value

print(condition)

# превращаем список в строку

condition = (" ".join(map(str, condition)))

print(condition)

"""

 задаем переменные (я понимаю, что это не совсем правильно, но другого способа победить пробел между кавычкой
 и цифрой я не нашел :-( )
 
 """

day_time, minutes, temperature = 5, "17", 5

# форматируем строку

condition = f'в "{day_time:02d}" часов "{minutes}" минут температура воздуха была "+{temperature:02d}" градусов'

# выводим результат

print(condition)

# Шпаргалка

"""

ord_list = '0123456789+-'
for number in ord_list:
    print(ord(number), end = " , ")
    
"""

"""
как мне кажется, чтобы выявить численные значения в списке, которые уже заданны как численные:
result = [x for x in condition if type(x) != str]
print(result)
"""