"""

Создать класс TrafficLight (светофор).
определить у него один атрибут color (цвет) и метод running (запуск);
атрибут реализовать как приватный;
в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
проверить работу примера, создав экземпляр и вызвав описанный метод.

"""


import time


class TrafficLight:
    __color = {'Красный': 4, 'Желтый': 3, 'Зеленый': 2}  # задаем мейн модуль цвет/время


    def switch_color(self):  # задаем перебор цвета в зависимости от времени
        for _ in range(1):
            for color, timer in self.__color.items():
                print(color)
                time.sleep(timer)


traffic_light = TrafficLight()
traffic_light.switch_color()
