"""

Представлен список чисел. Определить элементы списка, не имеющие повторений. Сформировать из этих элементов список
с сохранением порядка их следования в исходном списке, например:
src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
result = [23, 1, 3, 10, 4, 11]


Подсказка: напишите сначала решение «в лоб». Потом подумайте об оптимизации.

"""


src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
unique_n = set()
tmp = set()


for _ in src:  # опять же аналогично вебику
    if _ not in tmp:
        unique_n.add(_)
    else:
        unique_n.discard(_)
    tmp.add(_)


unique_n_set = [_ for _ in src if _ in unique_n]
print(unique_n_set)
