"""

Реализовать простую систему хранения данных о суммах продаж булочной.
Должно быть два скрипта с интерфейсом командной строки:
для записи данных и для вывода на экран записанных данных.
При записи передавать из командной строки значение суммы продаж.
Для чтения данных реализовать в командной строке следующую логику:
просто запуск скрипта — выводить все записи;
запуск скрипта с одним параметром-числом — выводить все записи с номера, равного этому числу, до конца;
запуск скрипта с двумя числами — выводить записи, начиная с номера,
равного первому числу, по номер, равный второму числу, включительно.

"""


def input_sales(argv):  # Ввод суммы продаж за день, для вывода см output

    """
    :param argv: сумма продаж за день
    :return: записывает в файл Bakery.csv
    """

    program, *arg = argv
    arg_st = ','.join(arg)
    with open('bakery.csv', 'a', encoding='utf-8') as f:
        f.write(f'{arg_st}\n')


if __name__ == '__main__':
    import sys
    exit(input_sales(sys.argv))
